local dashboard = require("dashboard")

dashboard.setup({
    theme = "hyper",
    config = {
        header = {
            "██╗   ██╗██╗███████╗███████╗██████╗ ██╗ ██████╗ ███╗   ██╗",
            "██║   ██║██║██╔════╝██╔════╝██╔══██╗██║██╔═══██╗████╗  ██║",
            "██║   ██║██║███████╗█████╗  ██████╔╝██║██║   ██║██╔██╗ ██║",
            "╚██╗ ██╔╝██║╚════██║██╔══╝  ██╔══██╗██║██║   ██║██║╚██╗██║",
            " ╚████╔╝ ██║███████║███████╗██║  ██║██║╚██████╔╝██║ ╚████║",
            "  ╚═══╝  ╚═╝╚══════╝╚══════╝╚═╝  ╚═╝╚═╝ ╚═════╝ ╚═╝  ╚═══╝",
        },

        shortcut = {
            { desc = "󰱼  Find File",       group = "@property",      action = "Telescope find_files", key = "f" },
            { desc = "󰈚  Recent Files",    group = "Label",          action = "Telescope oldfiles",   key = "r" },
            { desc = "󰒲  Plugin Store",     group = "Number",         action = "Store",                 key = "s" },
            { desc = "  Update Plugins",   group = "DiagnosticHint", action = "Lazy sync",            key = "u" },
            { desc = "  Quit",             group = "Error",         action = "qa",                   key = "q" },
        },

        footer = { "🚀" },
    },
})

vim.cmd([[ highlight DashboardHeader guifg=#8F7635 ]])
